{
  "metadata": {
    "organisation": "NHS England, Centre for Advancing Practice (CfAP)",
    "title": "Mental health advanced practice area specific capability and curriculum framework",
    "date": "2022",
    "abbreviation": "CfAP Advanced Mental Health (2022)",
    "version": "1",
    "dependencies": ["advanced_generic.json"],
    "source_url": "https://advanced-practice.hee.nhs.uk/mpf2025/capabilities/"
  },
  "structure": [
    {
      "id": "A",
      "node_type": "Domain",
      "text": "Person-centred therapeutic alliance",
      "children": [
        {
          "id": "A1",
          "node_type": "Capability",
          "text": "Demonstrate advanced level communication skills",
          "children": [
            {"id": "1.1", "node_type": "Statement", "text": "Critically appraise and apply the evidence base around therapeutic factors that influence engagement, empowerment and recovery."},
            {"id": "1.2", "node_type": "Statement", "text": "Use appropriate verbal and non-verbal empathic communication that respects the person, addresses any adaptation needs, barriers and inequalities, ensures partnership and shared decision making, and is collaborative, non-discriminatory and non-judgmental."},
            {"id": "1.3", "node_type": "Statement", "text": "Demonstrate expertise in establishing and maintaining a therapeutic relationship in the presence of sensitive information, uncertainly, complexity, conflict and distress."},
            {"id": "1.4", "node_type": "Statement", "text": "Clearly communicate synthesised, complex information."}
          ]
        },
        {
          "id": "A2",
          "node_type": "Capability",
          "text": "Manage their work and responses to the work",
          "children": [
            {"id": "1.5", "node_type": "Statement", "text": "Demonstrate a critical awareness and deep understanding of therapeutic boundaries, and apply self-awareness to attend to own reactions within relationships."},
            {"id": "1.6", "node_type": "Statement", "text": "Reflect on, explore and address complex ethical/moral dilemmas within practice."},
            {"id": "1.7", "node_type": "Statement", "text": "Proactively engage in appropriate supervision commensurate with scope of practice."}
          ]
        },
        {
          "id": "A3",
          "node_type": "Capability",
          "text": "Facilitate co-production",
          "children": [
            {"id": "1.8", "node_type": "Statement", "text": "Demonstrate critical understanding of how professional values and perspectives, and those of the person involved in co-production, may differ, and the influence this may have on engagement, assessment, treatment and management."},
            {"id": "1.9", "node_type": "Statement", "text": "Act with inclusivity, initiative and creativity to incorporate strength-based principles to meet identified need."},
            {"id": "1.10", "node_type": "Statement", "text": "Exemplify an attitude of hope, optimism and partnership."},
            {"id": "1.11", "node_type": "Statement", "text": "Critically apply knowledge of the wider determinants of health in order to create physical, social and attitudinal environments that promote health and wellbeing."}
          ]
        },
        {
          "id": "A4",
          "node_type": "Capability",
          "text": "Display professional accountability",
          "children": [
            {"id": "1.12", "node_type": "Statement", "text": "Practice in compliance with their respective code of professional conduct and within their scope of practice, being responsible and accountable for their decisions, actions and omissions at advanced level of practice."},
            {"id": "1.13", "node_type": "Statement", "text": "Demonstrate a critical understanding of their broadened level of critical decision making, accountability, responsibility and autonomy, and the limits of their own competence and professional scope of practice, including when working with conflict, complexity, risk, uncertainty and incomplete information."},
            {"id": "1.14", "node_type": "Statement", "text": "Act on professional judgement about when to seek help, demonstrating critical reflection on their own practice, self-awareness, emotional intelligence, and openness to change."}
          ]
        },
        {
          "id": "A5",
          "node_type": "Capability",
          "text": "Advocate for potentially vulnerable people and groups",
          "children": [
            {"id": "1.15", "node_type": "Statement", "text": "Demonstrate critical understanding of the impact of population health and wellbeing, and take appropriate steps to address inequalities and vulnerabilities."},
            {"id": "1.16", "node_type": "Statement", "text": "Demonstrate critical awareness of the potential for stigmatisation and the possible impact on co-production, intervention and motivation."},
            {"id": "1.17", "node_type": "Statement", "text": "Promote and demonstrate action in support of marginalised, under-represented and disadvantaged people and groups."},
            {"id": "1.18", "node_type": "Statement", "text": "Demonstrate critical understanding of the multiple perspectives within a situation and ensure that needs of carers, of all ages, and family members, are appropriately assessed, explored and addressed."}
          ]
        }
      ]
    },
    {
      "id": "B",
      "node_type": "Domain",
      "text": "Assessment and investigations",
      "children": [
        {
          "id": "B1",
          "node_type": "Capability",
          "text": "Demonstrate clinical expertise",
          "children": [
            {"id": "2.1", "node_type": "Statement", "text": "Demonstrate a deep and critical understanding of psychological, biological and social theories of mental health and ill health across the lifespan."},
            {"id": "2.2", "node_type": "Statement", "text": "Demonstrate advanced knowledge and understanding of mental health-related presentations"},
            {"id": "2.3", "node_type": "Statement", "text": "Demonstrate critical understanding of the complex interplay between psychological, biological and social factors that affect health, activity and wellness."},
            {"id": "2.4", "node_type": "Statement", "text": "Demonstrate knowledge and application of local, statutory and legal obligations related to the care and treatment of those with mental ill health."},
            {"id": "2.5", "node_type": "Statement", "text": "Demonstrate and apply understanding of a wide range of validated assessment and interventional theories related to scope of practice."},
            {"id": "2.6", "node_type": "Statement", "text": "Maintain and critically appraise clinically effective, digital technology-enabled intervention opportunities."}
          ]
        },
        {
          "id": "B2",
          "node_type": "Capability",
          "text": "Undertake appropriate assessment and investigations",
          "children": [
            {"id": "2.7", "node_type": "Statement", "text": "Critically apply advanced knowledge of mental health and illness"},
            {"id": "2.8", "node_type": "Statement", "text": "Exhibit professional curiosity in undertaking and articulating comprehensive, person-centred history taking and assessment, with a focus on psychological, biological and social perspectives, in line with agreed scope of practice."},
            {"id": "2.9", "node_type": "Statement", "text": "Critically assess and determine a person's capacity to make choices and decisions."},
            {"id": "2.10", "node_type": "Statement", "text": "Effectively explore, assimilate and synthesise information from various other appropriate sources."},
            {"id": "2.11", "node_type": "Statement", "text": "Critically assess and appraise complex, incomplete, ambiguous and conflicting information, distilling and synthesising key factors from the appraisal, and identify those elements that may need to be pursued further."},
            {"id": "2.12", "node_type": "Statement", "text": "Articulate comprehensive history, mental state examination, physical assessment, and overall formulation, verbally and in written form."},
            {"id": "2.13", "node_type": "Statement", "text": "Identify and lead response, in a timely manner, to the deteriorating condition and presentation of the person in the presence of acuity and/or mental health/physiological deterioration."},
            {"id": "2.14", "node_type": "Statement", "text": "Effectively assess, exclude, recognise and address physical health issues within the scope of practice, referring, as required, for more specialist assessment and intervention."}
          ]
        }
      ]
    },
    {
      "id": "C",
      "node_type": "Domain",
      "text": "Formulation",
      "children": [
        {
          "id": "C",
          "node_type": "Capability",
          "text": "Construct formulations of patients' problems",
          "children": [
            {"id": "3.1", "node_type": "Statement", "text": "Use expertise and decision-making skills to inform clinical reasoning approaches when dealing with differentiated and undifferentiated individual presentations and complex situations, synthesising information from multiple sources to make appropriate, evidence-based judgements and/or diagnoses."},
            {"id": "3.2", "node_type": "Statement", "text": "Develop differential judgements, recognising key biases and common errors, including diagnostic overshadowing and the issues relating to diagnosis in the face of ambiguity and incomplete data."},
            {"id": "3.3", "node_type": "Statement", "text": "Exercise critical curiosity in applying comprehensive psychological, biological and social formulation."},
            {"id": "3.4", "node_type": "Statement", "text": "Critically select and utilise current, internationally recognised classification criteria where appropriate."}
          ]
        }
      ]
    },
    {
      "id": "D",
      "node_type": "Domain",
      "text": "Collaborative planning",
      "children": [
        {
          "id": "D1",
          "node_type": "Capability",
          "text": "Work collaboratively",
          "children": [
            {"id": "4.1", "node_type": "Statement", "text": "Lead effective intervention, incorporating collaboration with a range of professions and agencies, across organisational boundaries."},
            {"id": "4.2", "node_type": "Statement", "text": "Demonstrate a systematic knowledge and understanding of the local care system and how to access different parts (including agencies outside of statutory care); collaborate and refer independently."},
            {"id": "4.3", "node_type": "Statement", "text": "Manage expectation of both intervention and service through knowledge of resources and availability."}
          ]
        },
        {
          "id": "D2",
          "node_type": "Capability",
          "text": "Promote safety and mitigate risk",
          "children": [
            {"id": "4.4", "node_type": "Statement", "text": "In the presence of uncertainty/emergency/emergent risk, analyse and modify intervention to mitigate risk."},
            {"id": "4.5", "node_type": "Statement", "text": "Critically analyse and apply feasibility judgement in consideration of risk-aware and risk adverse intervention."},
            {"id": "4.6", "node_type": "Statement", "text": "Exercise professional judgement and leadership to effectively promote safety, especially in the presence in multi-morbidity, complexity and/or unpredictability."},
            {"id": "4.7", "node_type": "Statement", "text": "Use a range of communication skills to discuss and develop collaborative, person centred, management strategies for planned and unplanned potential points of challenge, exploring the potential risks and benefits."},
            {"id": "4.8", "node_type": "Statement", "text": "Lead collaboration with an appropriate range of multi-agency and inter-professional resources, developing, maintaining and evaluating links to least restrictive practice and balancing the complexity of risk and safety, across organisations and settings."}
          ]
        }
      ]
    },
    {
      "id": "E",
      "node_type": "Domain",
      "text": "Intervention and evaluation",
      "children": [
        {
          "id": "E1",
          "node_type": "Capability",
          "text": "Lead care and treatment planning",
          "children": [
            {"id": "5.1", "node_type": "Statement", "text": "Critically and collaboratively explore a range of strength-based occupational, environmental and social interventions."},
            {"id": "5.2", "node_type": "Statement", "text": "Apply an in-depth critical understanding of the potential role for pharmacological interventions, balanced with an understanding of potential adverse effects and unwanted outcomes."},
            {"id": "5.3", "node_type": "Statement", "text": "Contribute to the process of medicines optimisation and appropriate intervention, in line with profession-specific capability and agreed scope of practice."},
            {"id": "5.4", "node_type": "Statement", "text": "Act in the knowledge of evidence about concordance with intervention, interactions and unwanted effects."},
            {"id": "5.5", "node_type": "Statement", "text": "Promote and lead the application of collaborative, feasible, person-centred, anticipatory care planning, with the presence of clear management strategies where care is needed out of hours."},
            {"id": "5.6", "node_type": "Statement", "text": "Utilise evidence-based, psychologically-informed intervention in line with the agreed scope of practice and under appropriate supervision."}
          ]
        },
        {
          "id": "E2",
          "node_type": "Capability",
          "text": "Prescribe intervention",
          "children": [
            {"id": "5.7", "node_type": "Statement", "text": "Prioritise timely intervention in situations where there are multiple issues, changing priorities and/or safety concerns."},
            {"id": "5.8", "node_type": "Statement", "text": "Critically apply evidence-based intervention in line with national guidance."},
            {"id": "5.9", "node_type": "Statement", "text": "Demonstrate a critical awareness and knowledge of evidence-based psychological interventions in order to be able to refer on appropriately for these."},
            {"id": "5.10", "node_type": "Statement", "text": "Explore and recommend collaborative social intervention informed by an understanding of local population health needs, agencies and networks"}
          ]
        },
        {
          "id": "E3",
          "node_type": "Capability",
          "text": "Evaluation",
          "children": [
            {"id": "5.11", "node_type": "Statement", "text": "Critically plan and apply collaborative evaluation of the efficacy of intervention, and modify following consultation."},
            {"id": "5.12", "node_type": "Statement", "text": "Analyse and apply appropriate evidence-based evaluation tools and/or outcome measures."}
          ]
        }
      ]
    },
    {
      "id": "F",
      "node_type": "Domain",
      "text": "Leadership and management, education and research - in addition to those within the multi-professional framework",
      "children": [
        {"id": "6.1", "node_type": "Statement", "text": "Exemplify leadership, resilience and determination, manage situations that are unfamiliar, uncertain, complex or unpredictable, and seek to build confidence in others."},
        {"id": "6.2", "node_type": "Statement", "text": "Lead the development of effective relationships, fostering clarity of roles across teams."},
        {"id": "6.3", "node_type": "Statement", "text": "Critically explore and analyse systems and practices in identifying, influencing and challenging unconscious bias, stigma and discrimination."},
        {"id": "6.4", "node_type": "Statement", "text": "Explore and apply a range of methodologies in delivering quality improvements."},
        {"id": "6.5", "node_type": "Statement", "text": "Negotiate an individual scope of practice within legal, ethical, professional and organisational policies, governance and procedures, with a focus on mitigating risk and upholding safety."},
        {"id": "6.6", "node_type": "Statement", "text": "Receive, lead and exemplify a culture of critically reflective clinical practice supervision."},
        {"id": "6.7", "node_type": "Statement", "text": "Act as a professional role model and educator in understanding and practice, in accordance with evidence-based practice and statutory responsibilities, including legislation, guidance, standards and regulatory requirements."},
        {"id": "6.8", "node_type": "Statement", "text": "Critically and strategically apply advanced clinical expertise across professional and service boundaries to enhance knowledge and understanding of mental health."}
      ]
    }
  ]
}
